import matplotlib.pyplot as plt
from statistics import mean

# x = [30, 300, 3000, 30000, 300000, 3000000, 15000000]
x1 = [
    # 1, 2, 3, 
    4, 5, 6, 7
    ]
y1 = [
      # mean([0.5782, 0.4513, 0.4344]), 
      # mean([0.9887, 0.9132, 0.7023]), 
      # mean([3.7824, 4.7283, 4.3137]),
      mean([29.4828, 30.983, 30.5678]),
      mean([281.445, 282.761, 299.446]),
      mean([2686.13, 2694.2, 2698.58]),
      mean([13571.7, 13837.2, 13626.2])
      ]
x2 = [
    # 1, 2, 3, 
    4, 5, 6, 7
    ]
y2 = [
      # mean([0.0433, 0.0356, 0.054]), 
      # mean([0.2994, 0.3498, 0.3375]), 
      # mean([3.1199, 2.8139, 3.2619]), 
      mean([26.1238, 26.135, 28.1276]),
      mean([263.513, 266.792, 265.201]),
      mean([2786.65, 2613.62, 2601.58]),
      mean([14062.9, 13900.4, 13708.5])
      ]

plt.plot(x1, y1, label='3 потокa')
plt.plot(x2, y2, label='1 поток')

plt.title("Зависимость времени от количества данных")
plt.xlabel("Количество строк, 3**(10**n)")
plt.ylabel("Среднее время выполнения, ms")
plt.legend()
plt.show()

